#pragma once
#include "VideoIO.h"

/*------------------------------------------------------------
Клас Player (ПРОГРАВАЧ) містить масив об'єктів класу Video
(мультимедійна бібліотека) та методи пошуку фільмів
за акторами, назвами, темами.
--------------------------------------------------------------*/
class Player
{
    int videoCount;     // кількість відеофайлів
    Video* videos;      // масив об'єктів Video
    VideoIO* ioWorker;  // об'єкт для вводу/виводу інформації про відео

public:
    Player();            // конструктор: запитує кількість і виділяє масив
    ~Player();           // деструктор: звільняє пам'ять

    void Fill();               // заповнення бібліотеки з консолі
    void ShowAll();             // вивід усіх фільмів
    void SearchByActor();       // пошук фільмів за актором
    void SearchByTitle();       // пошук фільмів за назвою
    void SearchByTheme();       // пошук фільмів за темою
};
